load_testing/results_for_report/cons_hash_3_phases_5_peaks_360s_1000keys.txt
wrk -t2 -c200 --timeout 15s --latency -s readLineByLine.lua -d360s -R3500 http://172.31.11.13:3000/
CONNECTED to addr       172.31.11.13:3000
CONNECTED to addr       172.31.10.136:3000
all addrs:
1       172.31.11.13:3000
2       172.31.10.136:3000
thread addr: 172.31.11.13:3000
all addrs:
1       172.31.11.13:3000
2       172.31.10.136:3000
thread addr: 172.31.10.136:3000
Running 6m test @ http://172.31.11.13:3000/
  2 threads and 200 connections
  Thread calibration: mean lat.: 346.035ms, rate sampling interval: 1931ms
  Thread calibration: mean lat.: 366.621ms, rate sampling interval: 1869ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    28.92ms   98.93ms   1.72s    96.18%
    Req/Sec     1.75k    72.30     2.17k    93.17%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    5.69ms
 75.000%   17.55ms
 90.000%   44.22ms
 99.000%  572.93ms
 99.900%    1.14s 
 99.990%    1.44s 
 99.999%    1.60s 
100.000%    1.72s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       1.241     0.000000            2         1.00
       2.127     0.100000       122490         1.11
       2.539     0.200000       245091         1.25
       3.047     0.300000       367088         1.43
       3.991     0.400000       489426         1.67
       5.691     0.500000       611730         2.00
       7.155     0.550000       672887         2.22
       9.463     0.600000       734137         2.50
      11.807     0.650000       795156         2.86
      14.255     0.700000       856315         3.33
      17.551     0.750000       917549         4.00
      19.679     0.775000       948238         4.44
      22.351     0.800000       978778         5.00
      25.647     0.825000      1009358         5.71
      29.807     0.850000      1039850         6.67
      35.519     0.875000      1070484         8.00
      39.391     0.887500      1085761         8.89
      44.223     0.900000      1101072        10.00
      50.559     0.912500      1116303        11.43
      59.359     0.925000      1131591        13.33
      72.191     0.937500      1146844        16.00
      81.087     0.943750      1154525        17.78
      92.607     0.950000      1162136        20.00
     108.543     0.956250      1169810        22.86
     131.071     0.962500      1177435        26.67
     166.527     0.968750      1185072        32.00
     192.511     0.971875      1188894        35.56
     228.351     0.975000      1192724        40.00
     274.687     0.978125      1196541        45.71
     333.311     0.981250      1200376        53.33
     405.503     0.984375      1204194        64.00
     444.415     0.985938      1206108        71.11
     487.423     0.987500      1208009        80.00
     539.135     0.989062      1209927        91.43
     595.455     0.990625      1211829       106.67
     659.967     0.992188      1213748       128.00
     695.807     0.992969      1214705       142.22
     734.207     0.993750      1215660       160.00
     772.607     0.994531      1216613       182.86
     814.591     0.995313      1217569       213.33
     860.671     0.996094      1218525       256.00
     887.807     0.996484      1219006       284.44
     914.943     0.996875      1219474       320.00
     946.175     0.997266      1219954       365.71
     979.455     0.997656      1220431       426.67
    1016.831     0.998047      1220913       512.00
    1036.799     0.998242      1221146       568.89
    1058.815     0.998437      1221385       640.00
    1083.391     0.998633      1221629       731.43
    1111.039     0.998828      1221866       853.33
    1144.831     0.999023      1222106      1024.00
    1162.239     0.999121      1222223      1137.78
    1183.743     0.999219      1222344      1280.00
    1204.223     0.999316      1222463      1462.86
    1230.847     0.999414      1222583      1706.67
    1254.399     0.999512      1222700      2048.00
    1269.759     0.999561      1222762      2275.56
    1285.119     0.999609      1222824      2560.00
    1299.455     0.999658      1222881      2925.71
    1319.935     0.999707      1222938      3413.33
    1339.391     0.999756      1222999      4096.00
    1350.655     0.999780      1223029      4551.11
    1368.063     0.999805      1223061      5120.00
    1381.375     0.999829      1223088      5851.43
    1400.831     0.999854      1223118      6826.67
    1419.263     0.999878      1223147      8192.00
    1429.503     0.999890      1223162      9102.22
    1441.791     0.999902      1223181     10240.00
    1451.007     0.999915      1223193     11702.86
    1461.247     0.999927      1223207     13653.33
    1483.775     0.999939      1223223     16384.00
    1492.991     0.999945      1223229     18204.44
    1501.183     0.999951      1223238     20480.00
    1508.351     0.999957      1223244     23405.71
    1520.639     0.999963      1223252     27306.67
    1525.759     0.999969      1223259     32768.00
    1530.879     0.999973      1223263     36408.89
    1543.167     0.999976      1223268     40960.00
    1550.335     0.999979      1223270     46811.43
    1563.647     0.999982      1223274     54613.33
    1575.935     0.999985      1223278     65536.00
    1585.151     0.999986      1223280     72817.78
    1591.295     0.999988      1223282     81920.00
    1598.463     0.999989      1223284     93622.86
    1602.559     0.999991      1223285    109226.67
    1606.655     0.999992      1223287    131072.00
    1610.751     0.999993      1223288    145635.56
    1611.775     0.999994      1223289    163840.00
    1619.967     0.999995      1223290    187245.71
    1627.135     0.999995      1223291    218453.33
    1630.207     0.999996      1223292    262144.00
    1630.207     0.999997      1223292    291271.11
    1643.519     0.999997      1223293    327680.00
    1643.519     0.999997      1223293    374491.43
    1678.335     0.999998      1223294    436906.67
    1678.335     0.999998      1223294    524288.00
    1678.335     0.999998      1223294    582542.22
    1693.695     0.999998      1223295    655360.00
    1693.695     0.999999      1223295    748982.86
    1693.695     0.999999      1223295    873813.33
    1693.695     0.999999      1223295   1048576.00
    1693.695     0.999999      1223295   1165084.44
    1719.295     0.999999      1223296   1310720.00
    1719.295     1.000000      1223296          inf
#[Mean    =       28.920, StdDeviation   =       98.928]
#[Max     =     1718.272, Total count    =      1223296]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1259216 requests in 6.00m, 323.25MB read
  Non-2xx or 3xx responses: 5
Requests/sec:   3497.83
Transfer/sec:      0.90MB
thread 0 made 629614 requests and got 629607 responses
thread 1 made 629614 requests and got 629609 responses
2022-06-05 05:08:31.776 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: NaN 
2022-06-05 05:08:36.915 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.1698990222792114 
2022-06-05 05:08:41.923 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.1389468931655287 
2022-06-05 05:08:46.794 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.1410814170292107 
2022-06-05 05:08:51.840 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.14721044793218 
2022-06-05 05:08:56.814 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.1325482916642498 
2022-06-05 05:09:01.836 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.1652806652806653 
2022-06-05 05:09:06.796 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.1379131037670442 
2022-06-05 05:09:11.814 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.1251930225907922 
2022-06-05 05:09:16.805 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.1220465651049152 
2022-06-05 05:09:21.806 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.1384941553976622 
2022-06-05 05:09:26.809 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.1553926341714875 
2022-06-05 05:09:31.859 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.1484871017559914 
2022-06-05 05:09:36.809 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.1580166821130675 
2022-06-05 05:09:41.808 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.1394296839212095 
2022-06-05 05:09:46.848 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.146413887619918 
2022-06-05 05:09:51.826 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.1283752596353567 
2022-06-05 05:09:56.832 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.1651555147480774 
2022-06-05 05:10:01.947 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.1264176881658838 
2022-06-05 05:10:06.827 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.1516721620348565 
2022-06-05 05:10:11.841 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.1272143553287852 
2022-06-05 05:10:16.892 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.1624784853700516 
2022-06-05 05:10:21.828 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.14298138806749 
2022-06-05 05:10:26.845 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.1185655456417296 
2022-06-05 05:10:31.853 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.1713037479880433 
2022-06-05 05:10:36.846 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.1292880537838303 
2022-06-05 05:10:41.872 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.1460017196904557 
2022-06-05 05:10:46.920 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.125195799733132 
2022-06-05 05:10:51.856 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.2456404611552052 
2022-06-05 05:10:56.864 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.2542917838893035 
2022-06-05 05:11:01.892 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.2787336545079147 
2022-06-05 05:11:06.884 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.2689639222941722 
2022-06-05 05:11:11.853 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.2165388385906235 
2022-06-05 05:11:16.855 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.2619456858026814 
2022-06-05 05:11:21.870 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.294892349977096 
2022-06-05 05:11:26.871 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.276056338028169 
2022-06-05 05:11:31.911 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.2534881061299177 
2022-06-05 05:11:36.871 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.2787539012830886 
2022-06-05 05:11:41.862 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.244486560992419 
2022-06-05 05:11:46.880 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.2687028140013727 
2022-06-05 05:11:51.875 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.2658133394558604 
2022-06-05 05:11:56.874 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.2615375795448032 
2022-06-05 05:12:01.988 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.252249585602652 
2022-06-05 05:12:06.871 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.2612956526693637 
2022-06-05 05:12:11.932 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.2743393204438853 
2022-06-05 05:12:16.895 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.2633680555555555 
2022-06-05 05:12:21.886 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.2651184180271327 
2022-06-05 05:12:26.924 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.2855424447244816 
2022-06-05 05:12:31.901 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.2611156022635408 
2022-06-05 05:12:36.888 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.2585761075676607 
2022-06-05 05:12:41.917 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.2712620027434842 
2022-06-05 05:12:46.890 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.2643585459991935 
2022-06-05 05:12:51.887 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.2629137555835528 
2022-06-05 05:12:56.916 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.2588000000000001 
2022-06-05 05:13:01.956 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.1916647452155869 
2022-06-05 05:13:06.935 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.3103288559518296 
2022-06-05 05:13:11.936 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.2791613575813738 
2022-06-05 05:13:16.922 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.3076967459035311 
2022-06-05 05:13:21.944 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.3189207886544447 
2022-06-05 05:13:26.904 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.29164265129683 
2022-06-05 05:13:31.930 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.2450918665216644 
2022-06-05 05:13:36.934 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.286231884057971 
2022-06-05 05:13:41.937 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.2620320855614973 
2022-06-05 05:13:46.944 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.2831751509922347 
2022-06-05 05:13:51.930 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.302540415704388 
2022-06-05 05:13:56.932 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.2998102466793169 
2022-06-05 05:14:02.079 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.296417499138822 
2022-06-05 05:14:06.919 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.2649944193150444 
2022-06-05 05:14:11.927 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.2849293114303704 
2022-06-05 05:14:16.950 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.2782653588022717 
2022-06-05 05:14:21.965 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.2967842144624058 
2022-06-05 05:14:26.948 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.280251470757873 
2022-06-05 05:14:31.936 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.2771167442662528 
2022-06-05 05:14:36.931 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.2708650357017441 
2022-06-05 05:14:41.928 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: NaN